GetReferenceType Method
 Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public FamilyInstanceReferenceType GetReferenceType(
	Reference reference
)
Visual Basic
Public Function GetReferenceType ( _
	reference As Reference _
) As FamilyInstanceReferenceType
Visual C++
public:
FamilyInstanceReferenceType GetReferenceType(
	Reference^ reference
)
Parameters
reference
Type: Autodesk.Revit.DBReference
 The family instance reference.
Return Value
 Returns the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference. Returns FamilyInstanceReferenceType.NotAReference if the instance reference doesn't correspond to a reference plane or line in the family.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →